<?php

namespace Faker\Provider\fr_FR;

class Color extends \Faker\Provider\Color
{
    protected static $safeColorNames = [
        'কালো', 'মেরুন', 'সবুজ', 'নেভি', 'জলপাই',
        'বেগুনি', 'লাইম', 'নীল', 'রুপালি','সোনালী',
        'ধূসর', 'হলুদ', 'সাদা','লাল','গোলাপী'
    ];

    protected static $allColorNames = [
        'এন্টিক হোয়াইট', 'সামুদ্রিক', 'অ্যাকোয়ামেরিন','আকাশী','কালো','নীল','হলুদাভ সবুজ',
        'বাদামী','চকোলেট','সায়ান', 'গাঢ় নীল', 'গাঢ় সায়ান','গাঢ় ধূসর','হলুদ',  'সাদা',
        'গাঢ় সবুজ', 'গাঢ় খাকি','গাঢ় ম্যাজেন্টা', 'গাঢ় জলপাই', 'গাঢ় কমলা', 'গাঢ় অর্কিড',
        'গাঢ় লাল','রক্তবেগুনী', 'গাঢ় গোলাপী','গাঢ় আকাশী', 'হালকা ধূসর','ইট কালার',
        'সোনালী', 'ধূসর', 'সবুজ', 'সবুজাভ হলুদ','নীল', 'আইভরি', 'খাকি', 'ল্যাভেন্ডার',
        'হালকা নীল','হালকা সায়ান', 'হালকা নীল', 'হালকা সবুজ', 'হালকা গোলাপী','গম',
        'হালকা হলুদ', 'ম্যাজেন্টা', 'মেরুন','মিস্টি গোলাপী','নেভি', 'জলপাই','শুভ্র', 'লাল',
        'কমলা', 'অর্কিড','গোলাপী','বেগুনি','রাজকীয় নীল','রুপালি', 'আকাশী নীল','টমেটো',
        'বেগুনী',
    ];
}
